zuheng1912/LPC1788-freertos-lwip/socket_TCPclient/User/arch/ethernetif.c
/*
 * Copyright (c) 2001-2004 Swedish Institute of Computer Science.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 * 3. The name of the author may not be used to endorse or promote products
 *    derived from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT
 * SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT
 * OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
 * IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
 * OF SUCH DAMAGE.
 *
 * This file is part of the lwIP TCP/IP stack.
 *
 * Author: Adam Dunkels <adam@sics.se>
 *
 */

/* lwIP includes. */
#include "lwip/opt.h"
#include "lwip/def.h"
#include "lwip/mem.h"
#include "lwip/pbuf.h"
#include "lwip/sys.h"
#include <lwip/stats.h>
#include <lwip/snmp.h>
#include "netif/etharp.h"
#include "ppp_oe.h"
#include "err.h"
#include "ethernetif.h"
#include "EMAC.h"
#include "lpc177x_8x_emac.h"
#include "lwIP.h"
#include "sys_arch.h"
#include "string.h"



/* Define those to better describe your network interface. */
#define IFNAME0 's'
#define IFNAME1 't'

#define  EMAC_MAX_PACKET_SIZE  1536  /* 1536 bytes */
/**
 * Helper struct to hold private data used to operate your ethernet interface.
 * Keeping the ethernet address of the MAC in this struct is not necessary
 * as it is already kept in the struct netif.
 * But this is only an example, anyway...
 */
 
xSemaphoreHandle s_xSemaphore = NULL;
sys_sem_t tx_sem = NULL;
sys_mbox_t eth_tx_mb = NULL;

LWIP_MEMPOOL_DECLARE(RX_POOL, 20, sizeof(struct pbuf_custom), "Zero-copy RX PBUF pool");

struct ethernetif
{
  struct eth_addr *ethaddr;
  /* Add whatever per-interface state that is needed here. */
  int unused;
};

/* Private variables ---------------------------------------------------------*/



/* Private function prototypes -----------------------------------------------*/

u32_t sys_now(void);
//static void arp_timer(void *arg);
void pbuf_free_custom(struct pbuf *p);

/**
 * In this function, the hardware should be initialized.
 * Called from ethernetif_init().
 *
 * @param netif the already initialized lwip network interface structure
 *        for this ethernetif
 */
static void
low_level_init(struct netif *netif)
{
   
  /* set MAC hardware address length */
  netif->hwaddr_len = ETHARP_HWADDR_LEN;

  /* set MAC hardware address */
  netif->hwaddr[0] =  emacETHADDR0;
  netif->hwaddr[1] =  emacETHADDR1;
  netif->hwaddr[2] =  emacETHADDR2;
  netif->hwaddr[3] =  emacETHADDR3;
  netif->hwaddr[4] =  emacETHADDR4;
  netif->hwaddr[5] =  emacETHADDR5;

  /* maximum transfer unit */
  netif->mtu = 1500;

  /* device capabilities */
  /* don't set NETIF_FLAG_ETHARP if this device is not an ethernet one */
  netif->flags = NETIF_FLAG_BROADCAST | NETIF_FLAG_ETHARP | NETIF_FLAG_LINK_UP;

    Init_EMAC(); 
		
		 s_xSemaphore = xSemaphoreCreateCounting(40,0);
		 
		 if(sys_sem_new(&tx_sem , 0) == ERR_OK)
    printf("sys_sem_new ok\n");
		 
		   if(sys_mbox_new(&eth_tx_mb , 50) == ERR_OK)
    printf("sys_mbox_new ok\n");
			 
			   /* create the task that handles the ETH_MAC */
	sys_thread_new("ETHIN",
                  ethernetif_input,  /* 任务入口函数 */
                  netif,        	  /* 任务入口函数参数 */
                  NETIF_IN_TASK_STACK_SIZE,/* 任务栈大小 */
                  NETIF_IN_TASK_PRIORITY); /* 任务的优先级 */
                  
  LWIP_MEMPOOL_INIT(RX_POOL);
			 

}

/**
 * This function should do the actual transmission of the packet. The packet is
 * contained in the pbuf that is passed to the function. This pbuf
 * might be chained.
 *
 * @param netif the lwip network interface structure for this ethernetif
 * @param p the MAC packet to send (e.g. IP packet including MAC addresses and type)
 * @return ERR_OK if the packet could be sent
 *         an err_t value if the packet couldn't be sent
 *
 * @note Returning ERR_MEM here if a DMA queue of your MAC is full can lead to
 *       strange results. You might consider waiting for space in the DMA queue
 *       to become availale since the stack doesn't retry to send a packet
 *       dropped because of memory failure (except for the TCP timers).
 */
extern uint8_t __attribute__ ((aligned (4))) gTxBuf[EMAC_MAX_PACKET_SIZE];

static err_t
low_level_output(struct netif *netif, struct pbuf *p)
{
  struct pbuf *q;
  int len = 0;
   
	static sys_sem_t ousem = NULL;  //创建信号量
	
		if(ousem == NULL)
  {
    sys_sem_new(&ousem,0);
    sys_sem_signal(&ousem);
  }
	
//	memset((u8_t*)&gTxBuf[len], 0 , ETH_TX_DESC_CNT*sizeof(ETH_BufferTypeDef));
	
	sys_sem_wait(&ousem);

  for(q = p; q != NULL; q = q->next) 
  {
    memcpy((u8_t*)&gTxBuf[len], q->payload, q->len);
	len = len + q->len;
  }

  SendFrame(gTxBuf, len);
  sys_sem_signal(&ousem);
	
  return ERR_OK;
}

/**
 * Should allocate a pbuf and transfer the bytes of the incoming
 * packet from the interface into the pbuf.
 *
 * @param netif the lwip network interface structure for this ethernetif
 * @return a pbuf filled with the received packet (including MAC header)
 *         NULL on memory error
 */
extern uint16_t *rptr;
extern uint16_t rx_size[EMAC_MAX_FRAME_NUM];
extern uint16_t* rx_ptr[EMAC_MAX_FRAME_NUM];
extern uint8_t rx_done, read_done;


static struct pbuf *
low_level_input(struct netif *netif)
{
	struct pbuf *p, *q;
	uint16_t len;
	
	/* Packet received */
	if( rx_size[read_done] == 0 )
	{
		return NULL;
	}
	
	rptr = rx_ptr[read_done];
	
	p = pbuf_alloc(PBUF_RAW, rx_size[read_done], PBUF_POOL);
	
	if (p != NULL) 
	{	  
		len = 0;
		
		/* We iterate over the pbuf chain until we have read the entire
		* packet into the pbuf. */
		for(q = p; q != NULL; q = q->next) 
		{
			/* Read enough bytes to fill this pbuf in the chain. The
			* available data in the pbuf is given by the q->len
			* variable. */
			memcpy((u8_t*)q->payload, (u8_t*)&rptr[len], q->len);
			len = len + q->len;
		}
		
		rx_size[read_done] = 0;
		read_done++;
		
		if(read_done >= EMAC_MAX_FRAME_NUM)
		{
			read_done = 0;
		}
	}
	else
	{
		return NULL;
	}
	
	return p; 
}

/**
 * This function should be called when a packet is ready to be read
 * from the interface. It uses the function low_level_input() that
 * should handle the actual reception of bytes from the network
 * interface. Then the type of the received packet is determined and
 * the appropriate input function is called.
 *
 * @param netif the lwip network interface structure for this ethernetif
 */
void ethernetif_input(void *pParams)
{ 
	struct netif *netif;
	struct pbuf *p = NULL;
	netif = (struct netif*) pParams;
	
  printf("ethernetif_input running\n");

	while(1)
	{		    
		
	  if(xSemaphoreTake( s_xSemaphore, portMAX_DELAY ) == pdTRUE) 
    {
			
			 	taskENTER_CRITICAL();
TRY_GET_NEXT_FRAGMENT:
			 p = low_level_input(netif);
			 
			  taskEXIT_CRITICAL();
			
				if (p != NULL)
				{
						taskENTER_CRITICAL();
						if( netif->input(p, netif) != ERR_OK )
						{
							LWIP_DEBUGF(NETIF_DEBUG, ("ethernetif_input: IP input error\n\r"));
							pbuf_free(p);
							p = NULL;
						}
					  else 
					  {
							xSemaphoreTake( s_xSemaphore, 0);
							goto TRY_GET_NEXT_FRAGMENT;
					  }
					
					taskEXIT_CRITICAL();
				 }	
			}			
		}		
	}

/**
 * Should be called at the beginning of the program to set up the
 * network interface. It calls the function low_level_init() to do the
 * actual setup of the hardware.
 *
 * This function should be passed as a parameter to netif_add().
 *
 * @param netif the lwip network interface structure for this ethernetif
 * @return ERR_OK if the loopif is initialized
 *         ERR_MEM if private data couldn't be allocated
 *         any other err_t on error
 */
err_t
ethernetif_init(struct netif *netif)
{
  struct ethernetif *ethernetif;

  LWIP_ASSERT("netif != NULL", (netif != NULL));

  ethernetif = mem_malloc(sizeof(struct ethernetif));
  if (ethernetif == NULL)
  {
    LWIP_DEBUGF(NETIF_DEBUG, ("ethernetif_init: out of memory\n"));
    return ERR_MEM;
  }

#if LWIP_NETIF_HOSTNAME
  /* Initialize interface hostname */
  netif->hostname = "lwip";
#endif /* LWIP_NETIF_HOSTNAME */

  /*
   * Initialize the snmp variables and counters inside the struct netif.
   * The last argument should be replaced with your link speed, in units
   * of bits per second.
   */
  NETIF_INIT_SNMP(netif, snmp_ifType_ethernet_csmacd, 100000000);

  netif->state = ethernetif;
  netif->name[0] = IFNAME0;
  netif->name[1] = IFNAME1;
  /* We directly use etharp_output() here to save a function call.
   * You can instead declare your own function an call etharp_output()
   * from it if you have to do some checks before sending (e.g. if link
   * is available...) */
  netif->output = etharp_output;
  netif->linkoutput = low_level_output;

  ethernetif->ethaddr = (struct eth_addr *)&(netif->hwaddr[0]);

  /* initialize the hardware */
  low_level_init(netif);

  return ERR_OK;
	
}
